EDT/УТ/src/Reports/ОтчетОСвоевременностиДоставки/ОтчетОСвоевременностиДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетОСвоевременностиДоставки</name>
  <attributes>
    <name>ВариантПостроенияОтчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокНомеров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопускатьПустуюПричинуОтказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

EDT/УТ/src/Reports/ОтчетОСвоевременностиДоставки/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ВариантПостроенияОтчета = 1;
	Отчет.ПериодОтчета.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Отчет.ПериодОтчета.ДатаОкончания = ТекущаяДата();

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	СкомпоноватьРезультат();
	
КонецПроцедуры


&НаКлиенте
Процедура СписокНомеровПриИзменении(Элемент)
	СписокНомеровЗначение = СтрРазделить(Отчет.СписокНомеров,Символы.ПС,Ложь);
	Элементы.СписокНомеров.Заголовок = "Список номеров (" + Строка(СписокНомеровЗначение.Количество()) + ")";
КонецПроцедуры
